var config = {
    /*在这里配置你的基本信息，所有数据以字符串形式给出*/
    name: "王来福",
    sex: "男",
    age: "20",
    phone: "18633660601",
    email: "1582247693@qq.com",
    address: "现居山东省济南市",
    qq: "1582247693",
    log: "Wild",


    /*在这里配置首页的座右铭集合*/
    motto: [
        "明天不一定会更好，但要坚信更好的明天一定会来。",
        "要做的事情总找得出时间和机会，不愿意做的事情也总能找得出借口。",
        "Gor For It!",
        "有智者立长志，无志者长立志。",
        "那些过去的眼泪终将风干在记忆里。",
        "真相，是为了剿灭幻想。",
        "我欲将心向明月，奈何明月照沟渠。",
        "春风得意马蹄疾，一日看尽长安花。",
        "天凉好个秋！",
        "老骥伏枥，志在千里。烈士暮年，壮心不已。",
        "老当益壮，宁移白首之心。穷且益坚，不坠青云之志。",
        "我们必须拿我们所有的， 去换我们所没有的",
        "蒹葭苍苍，白露为霜；所谓伊人，在水一方。",
        "数风流人物，还看今朝！"
    ],


    /*在这里配置首页的见面信息，你可以内嵌HTML标签以调整格式*/
    welcome: "青青子衿，悠悠我心<br>" +
             "但为君故，沉吟至今<br>" +
             "你好，我是Wild，齐鲁工业大学大二在读生<br>" +
             "很高兴见到你!",


    /*在这里配置关于我的信息，你可以内嵌HTML标签以调整格式*/
    about: "<p>你好！我叫Wild，性别男，齐鲁工业大学大二在读。</p>" +
        "<p>我有着较多的C++编程经验，参加过ACM集训队，拿过一些奖项，对于算法很感兴趣，写过一些小的项目。</p>" +
        "<p>十分期待与您的联系!</p>",



    /** 
    * 在这里配置你的技能点
    * ["技能点", 掌握程度, "技能条颜色"]
    */  
    skills: [
        ["算法", 80, "red"],
        ["Play", 77, "blue"],
        ["Eat", 75, "#1abc9c"],
        ["Python", 67, "rgba(0,0,0)"],
       
    ],


    /*这里填写你的技能描述，你可以内嵌HTML标签以调整格式*/
    skills_description: "<ul>" +
        "     <li>C语言，Python等编程基础知识良好。</li>" +
        "     <li>熟练掌握Java基础。</li>" +
        "     <li>熟悉JavaIO、多线程、集合等基础框架。</li>" +
        "     <li>了解JVM原理。</li>" +
        "     <li>熟悉SQL语句编写以及调优。</li>" +
        "     <li>熟悉缓存、消息等机制。</li>" +
        "     <li>了解嵌入式系统的设计与应用。</li>" +
        "     <li>了解HTML、CSS、JavaScript以及相应前端知识。</li>" +
        " </ul>",


    /**
     * 这里填写你的个人作品展示
     * ["img"，"url", "ProjectName", "brief"]
     * img表示您的作品图片链接，url表示您的项目地址，ProjectName表示您的仓库或作品名称，brief是一句简短的介绍
     * 通过查看实际效果以调整字题长度
     */
    portfolio: [
        ["","","",""],
        ["./images/pro.jpg", "https://github.com/WildWLF/-OpenCV-", "基于OpenCV的铁轨位移检测", "采用C++基于OpenCV编写的铁轨位移检测项目<br>2023/6/13"],
        ["","","",""]
    ],


    /**
     * 这里填写您的工作经历
     * ["日期"， "工作"， "介绍"]
     * 你可以内嵌HTML标签以排版格式
     */
    work: [
        //如果您内有工作经历，您可以采取下列写法
        // ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]

        ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]
    ],


    /**
     * 这里填写你的其他经历
     * ["日期"， "经历"， "介绍"]
     * 建议填写您的校级及以上得奖经历或或其他证书
     */
    others: [
        ["2023-04-23", "第十四届蓝桥杯大学生B组省二等奖", "大一下学期，我参与第十四届蓝桥杯大学生B组，经验不足，仅获得省二等奖。"],
        ["2023-05-05", "2023团体程序设计天梯赛团体三等奖", "大一下学期，代表QLU3队参加团体程序设计天梯赛，获得团体省三等奖"],
        ["2023-08-25", "2023年睿抗机器人开发者大赛（RAICOM）全国三等奖", "大一暑假，参加RAICOM，获得国家三等奖。"],
        ["2024-06-01", "第十五届蓝桥杯大学生B组全国三等奖","大二上学期，参加十五届蓝桥杯大学生B组，获得国家三等奖。"]
    ],


    /**
     * 在这里填写您的社交网络平台
     * ["img", "url", "desc"]
     * img是社交平台的图标，在./svg目录下我们已经准备好了 微博、简书、掘金、小红书、知乎、csdn、facebook、github、力扣、CF和qq的图标
     * url是您链接
     * desc是一段描述，将鼠标移入将会显示该描述
     * 建议您放置数量 <= 5
     */
    icon: [
        ["./svg/codeforces.svg", "https://codeforces.com/profile/Wild-WL", "我的Codeforces主页"],
        ["./svg/github.svg", "https://github.com/WildWLF", "我的GitHub主页"]
    ],


    //这是一些图片链接，建议您仅更改第二个头像图片
    url: [
        //背景图、头像、作品展示背景、其他经历背景
        "./images/b1ground.jpg",
        "./images/test2.jpg",
        "./images/background.jpg",
        "./images/4.jpg"
    ]

}
